Assignments/Assignment2/convertFahrenheitToKelvin-response.xml

<?xml version="1.0" ?>
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    soap:encodingStyle="http://w3.org/2003/05/soap-encoding">

    <!-- omitted header element -->
    
    <soap:Body xmlns:xs="http://www.mockresources.io">
        <!-- response -->
        <xs:getKevinFromFahrenheit>
            <xs:Kevin>-12.094444</xs:Kevin>
        </xs:getKevinFromFahrenheit>
    </soap:Body>
</soap:Envelope>